var sourceData_2values = [{
    begin_time: 1465954353000,
    end_time: 1467007193000,
    data: [{
        "max(投入工时变化量)" : 32929.0,
        "机器" : '501中板焊接检测02'
    }, {
        "max(投入工时变化量)" : 32733.0,
        "机器" : '502中板焊接检测03'
    }, {
        "max(投入工时变化量)" : 32690.0,
        "机器" : '502中板焊接检测02'
    }, {
        "max(投入工时变化量)" : 32689.0,
        "机器" : '502中板焊接检测01'
    }, {
        "max(投入工时变化量)" : 32683.0,
        "机器" : '501中板焊接检测01'
    }]
}];
var ds = [{
    data:[45,22,77,53, 45,22,77,53,64,93,13,44,89,99,38,34,55,76,94,22],
    // [45,22,77,53],
     // [45,22,77,53,64,93,13,44,89,99,38,34,55,76,94,22,58,83,75,20],
    name: '602Logo检测机',
    x: {
        name: '料件',
        as: "材料"
    },
    y:{
        name: "sum(投入工时变化量)",
        as: '投入工时变化量总和'
    }
},{
    data: [ 45,22,77,53,64,93,13,44,89,99,38,34,55,76,94,22,58,83,75,20].reverse(),
    // [45,22,77,53].reverse(),
    // ,64,93,13,44,89,99,38,34,55,76,94,22,58,83,75,20].reverse(),
    name: '601Logo检测机',
    x: {
        name: '料件',
        as: "材料"
    },
    y:{
        name: "sum(投入工时变化量)",
        as: '投入工时变化量总和'
    }
}];
var sourceData_2values_withTime = [{
    begin_time: 1466956800000,
    end_time: 1466960400000,
    x:["料件"],
    y:["sum(投入工时变化量)"],
    data: [{
        "料件" : '602Logo检测机',
        "sum(投入工时变化量)" : 10800126
    }, {
        "料件" : '601Logo检测机',
        "sum(投入工时变化量)" : 10800073
    }]
}, {
    begin_time: 1466960400000,
    end_time: 1466964000000,
    data: [{
        "料件" : '601Logo检测机',
        "sum(投入工时变化量)" : 10799234
    }, {
        "料件" : '602Logo检测机',
        "sum(投入工时变化量)" : 10799003
    }]
}, {
    begin_time: 1466964000000,
    end_time: 1466967600000,
    data: [{
        "料件" : '602Logo检测机',
        "sum(投入工时变化量)" : 10800555
    }, {
        "料件" : '601Logo检测机',
        "sum(投入工时变化量)" : 10799482
    }]
}, {
    begin_time: 1466967600000,
    end_time: 1466971200000,
    data: [{
        "料件" : '602Logo检测机',
        "sum(投入工时变化量)" : 10799994
    }, {
        "料件" : '601Logo检测机',
        "sum(投入工时变化量)" : 10799569
    }]
}, {
    begin_time: 1466971200000,
    end_time: 1466974800000,
    data: [{
        "料件" : '601Logo检测机',
        "sum(投入工时变化量)" : 10800682
    }, {
        "料件" : '602Logo检测机',
        "sum(投入工时变化量)" : 10800256
    }]
}, {
    begin_time: 1466974800000,
    end_time: 1466978400000,
    data: [{
        "料件" : '601Logo检测机',
        "sum(投入工时变化量)" : 10800097
    }, {
        "料件" : '602Logo检测机',
        "sum(投入工时变化量)" : 10799445
    }]
}, {
    begin_time: 1466978400000,
    end_time: 1466982000000,
    data: [{
        "料件" : '602Logo检测机',
        "sum(投入工时变化量)" :1.08001
    }, {
        "料件" : '601Logo检测机',
        "sum(投入工时变化量)" : 10799807
    }]
}, {
    begin_time: 1466982000000,
    end_time: 1466985600000,
    data: [{
        "料件" : '602Logo检测机',
        "sum(投入工时变化量)" : 10800027
    }, {
        "料件" : '601Logo检测机',
        "sum(投入工时变化量)" : 10799544
    }]
}, {
    begin_time: 1466985600000,
    end_time: 1466989200000,
    data: [{
        "料件" : '601Logo检测机',
        "sum(投入工时变化量)" : .080054
    }, {
        "料件" : '602Logo检测机',
        "sum(投入工时变化量)" : 10799391
    }]
}, {
    begin_time: 1466989200000,
    end_time: 1466992800000,
    data: [{
        "料件" : '602Logo检测机',
        "sum(投入工时变化量)" : 10800342
    }, {
        "料件" : '601Logo检测机',
        "sum(投入工时变化量)" : 10799694
    }]
}, {
    begin_time: 1466992800000,
    end_time: 1466996400000,
    data: [{
        "料件" : '602Logo检测机',
        "sum(投入工时变化量)" : 10800673
    }, {
        "料件" : '601Logo检测机',
        "sum(投入工时变化量)" : 10800204
    }]
}, {
    begin_time: 1466996400000,
    end_time: 1467000000000,
    data: [{
        "料件" : '601Logo检测机',
        "sum(投入工时变化量)" : 10800087
    }, {
        "料件" : '602Logo检测机',
        "sum(投入工时变化量)" : 10799576
    }]
}, {
    begin_time: 1467000000000,
    end_time: 1467003600000,
    data: [{
        "料件" : '601Logo检测机',
        "sum(投入工时变化量)" : 10800944
    }, {
        "料件" : '602Logo检测机',
        "sum(投入工时变化量)" : 10800067
    }]
}, {
    begin_time: 1467003600000,
    end_time: 1467007200000,
    data: [{
        "料件" : '602Logo检测机',
        "sum(投入工时变化量)" : 10800777
    }, {
        "料件" : '601Logo检测机',
        "sum(投入工时变化量)" : 10799473
    }]
}, {
    begin_time: 1467007200000,
    end_time: 1467007294000,
    data: [{
        "料件" : '602Logo检测机',
        "sum(投入工时变化量)" : 240229.0
    }, {
        "料件" : '601Logo检测机',
        "sum(投入工时变化量)" : 239267.0
    }]
}];

var sourceData_3values_withTime = [{
    begin_time: 1466956800000,
    end_time: 1466960400000,
    data: [{
        "料件" : '601Logo检测机',
        "sum(投入工时变化量)" : 10800073,
        "制程" : '601'
    }, {
        "料件" : '602Logo检测机',
        "sum(投入工时变化量)" : 10800126,
        "制程" : '602'
    }]
}, {
    begin_time: 1466960400000,
    end_time: 1466964000000,
    data: [{
        "料件" : '601Logo检测机',
        "sum(投入工时变化量)" : 10799234,
        "制程" : '601'
    }, {
        "料件" : '602Logo检测机',
        "sum(投入工时变化量)" : 10799003,
        "制程" : '602'
    }]
}, {
    begin_time: 1466964000000,
    end_time: 1466967600000,
    data: [{
        "料件" : '601Logo检测机',
        "sum(投入工时变化量)" : 10799482,
        "制程" : '601'
    }, {
        "料件" : '602Logo检测机',
        "sum(投入工时变化量)" : 10800555,
        "制程" : '602'
    }]
}, {
    begin_time: 1466967600000,
    end_time: 1466971200000,
    data: [{
        "料件" : '601Logo检测机',
        "sum(投入工时变化量)" : 10799569,
        "制程" : '601'
    }, {
        "料件" : '602Logo检测机',
        "sum(投入工时变化量)" : 10799994,
        "制程" : '602'
    }]
}, {
    begin_time: 1466971200000,
    end_time: 1466974800000,
    data: [{
        "料件" : '601Logo检测机',
        "sum(投入工时变化量)" : 10800682,
        "制程" : '601'
    }, {
        "料件" : '602Logo检测机',
        "sum(投入工时变化量)" : 10800256,
        "制程" : '602'
    }]
}, {
    begin_time: 1466974800000,
    end_time: 1466978400000,
    data: [{
        "料件" : '601Logo检测机',
        "sum(投入工时变化量)" : 10800097,
        "制程" : '601'
    }, {
        "料件" : '602Logo检测机',
        "sum(投入工时变化量)" : 10799445,
        "制程" : '602'
    }]
}, {
    begin_time: 1466978400000,
    end_time: 1466982000000,
    data: [{
        "料件" : '601Logo检测机',
        "sum(投入工时变化量)" : 10799807,
        "制程" : '601'
    }, {
        "料件" : '602Logo检测机',
        "sum(投入工时变化量)" :1.08001,
        "制程" : '602'
    }]
}, {
    begin_time: 1466982000000,
    end_time: 1466985600000,
    data: [{
        "料件" : '601Logo检测机',
        "sum(投入工时变化量)" : 10799544,
        "制程" : '601'
    }, {
        "料件" : '602Logo检测机',
        "sum(投入工时变化量)" : 10800027,
        "制程" : '602'
    }]
}, {
    begin_time: 1466985600000,
    end_time: 1466989200000,
    data: [{
        "料件" : '601Logo检测机',
        "sum(投入工时变化量)" : .080054,
        "制程" : '601'
    }, {
        "料件" : '602Logo检测机',
        "sum(投入工时变化量)" : 10799391,
        "制程" : '602'
    }]
}, {
    begin_time: 1466989200000,
    end_time: 1466992800000,
    data: [{
        "料件" : '601Logo检测机',
        "sum(投入工时变化量)" : 10799694,
        "制程" : '601'
    }, {
        "料件" : '602Logo检测机',
        "sum(投入工时变化量)" : 10800342,
        "制程" : '602'
    }]
}, {
    begin_time: 1466992800000,
    end_time: 1466996400000,
    data: [{
        "料件" : '601Logo检测机',
        "sum(投入工时变化量)" : 10800204,
        "制程" : '601'
    }, {
        "料件" : '602Logo检测机',
        "sum(投入工时变化量)" : 10800673,
        "制程" : '602'
    }]
}, {
    begin_time: 1466996400000,
    end_time: 1467000000000,
    data: [{
        "料件" : '601Logo检测机',
        "sum(投入工时变化量)" : 10800087,
        "制程" : '601'
    }, {
        "料件" : '602Logo检测机',
        "sum(投入工时变化量)" : 10799576,
        "制程" : '602'
    }]
}, {
    begin_time: 1467000000000,
    end_time: 1467003600000,
    data: [{
        "料件" : '601Logo检测机',
        "sum(投入工时变化量)" : 10800944,
        "制程" : '601'
    }, {
        "料件" : '602Logo检测机',
        "sum(投入工时变化量)" : 10800067,
        "制程" : '602'
    }]
}, {
    begin_time: 1467003600000,
    end_time: 1467007200000,
    data: [{
        "料件" : '601Logo检测机',
        "sum(投入工时变化量)" : 10799473,
        "制程" : '601'
    }, {
        "料件" : '602Logo检测机',
        "sum(投入工时变化量)" : 10800777,
        "制程" : '602'
    }]
}, {
    begin_time: 1467007200000,
    end_time: 1467007384000,
    data: [{
        "料件" : '601Logo检测机',
        "sum(投入工时变化量)" : 510185.0,
        "制程" : '601'
    }, {
        "料件" : '602Logo检测机',
        "sum(投入工时变化量)" : 509965.0,
        "制程" : '602'
    }]
}]